Repository: NileTronixRepositories/NPark
Catalog: NPark.Domain/Resource/ErrorMessage.*.resx
Languages: ar

# AlreadyExists
source: Resource already exists.
ar: المورد موجود بالفعل.

# CardNumber_Required
source: Card number is required.
ar: رقم البطاقة مطلوب.

# ConfirmPasswordRequired
source: Please confirm your password.
ar: يرجى تأكيد كلمة المرور.

# Conflict_IsRepeated
source: IsRepeated cannot be true when DurationType is Days.
ar: لا يمكن أن يكون "مكرر" صحيحًا عندما يكون "نوع المدة" أيام.

# InvalidPrice
source: Price cannot be less than zero.
ar: لا يمكن أن يكون السعر أقل من الصفر.

# Invalid_EndTime
source: EndTime cannot be earlier than StartTime.
ar: لا يمكن أن يكون وقت الانتهاء قبل وقت البدء.

# Invalid_EntryGatesCount
source: Entry gates count must be at least 1
ar: عدد بوابات الدخول يجب ألا يقل عن 1

# Invalid_ExitGatesCount
source: Exit gates count must be at least 1
ar: عدد بوابات الخروج يجب ألا يقل عن1.

# Invalid_Image
source: image must be a valid image file (jpg, png, jpeg).
ar: ملف الصورة غير صالح، يُسمح فقط بالامتدادات ‎.jpg و ‎.jpeg و ‎.png

# Invalid_NationalId
source: National ID must be a valid 14-digit Egyptian ID.
ar: رقم البطاقة الشخصية يجب أن يكون رقم مصري مكون من 14 رقم."

# Invalid_PhoneNumber
source: Phone number must be a valid Egyptian phone number.
ar: رقم الهاتف يجب أن يكون رقم هاتف مصري صالح.

# Invalid_TotalDays
source: TotalDays must be greater than zero when DurationType is Days.
ar: "عدد الأيام" يجب أن يكون أكبر من صفر عندما يكون "نوع المدة" هو أيام.

# Invalid_TotalHour
source: TotalHours must be greater than zero when DurationType is Hours.
ar: "عدد الساعات" يجب أن يكون أكبر من صفر عندما يكون "نوع المدة" هو ساعات.

# IsRequired
source: he field {0} is required.
ar: الحقل {0} مطلوب.

# Name_Required
source: Name is required.
ar: الاسم مطلوب

# NotFound
source: Resource not found.
ar: المورد غير موجود

# OrderPiorityIsRequired
source: OrderPriority is required when IsRepeated is true.
ar: تحديد أولوية الطلب أمر مطلوب عندما يكون "مكرر" صحيحًا.

# OrderPiority_Unique
source: OrderPriority must be unique.
ar: يجب أن تكون أولوية الطلب فريدة.

# OutOfRange
source: Value out of range for: {0}.
ar: القيمة خارج النطاق للحقل: {0}.

# PasswordMismatch
source: Password and confirm password do not match.
ar: كلمة المرور وتأكيد كلمة المرور غير متطابقين.

# PasswordRequired
source: Password is required.
ar: كلمة المرور مطلوبة.

# Phone_Required
source: Phone is required.
ar: الهاتف مطلوب

# PricingSchemeId
source: Pricing Scheme ID is required.
ar: معرف خطة التسعير مطلوب.

# TotalDay_Require
source: TotalDays is required when DurationType is Days.
ar: "عدد الأيام" مطلوب عندما يكون "نوع المدة" هو أيام.

# TotalHour_Require
source: TotalHours is required when DurationType is Hours.
ar: عدد الساعات" مطلوب عندما يكون "نوع المدة" هو ساعات.

# Unique_NationalId
source: National ID must be unique
ar: الرقم القومي مستخدم بالفعل لمشترك آخر

# Unique_Phone
source: Phone number must be unique.
ar: رقم الهاتف يجب أن يكون فريد

# VehicleNumber_Required
source: Vehicle number is required.
ar: رقم المركبة مطلوب.

# WrongLogin
source: Invalid username or password.
ar: اسم المستخدم أو كلمة المرور غير صحيحة.

source: Wrong Password
ar: كلمة المرور غير صحيحة

source: Invalid price type
ar: نوع التسعير غير صالح

# Invalid_VehiclePassengerData
source: Invalid vehicle/passenger data type
ar: نوع بيانات السيارة أو الراكب غير صالح.

source: Invalid print type.
ar: نوع الطباعة غير صالح

# Invalid_AllowedParkingSlots
source: Allowed parking slots must be greater than 0
ar: عدد الباكيات المسموح يجب أن يكون أكبر من صفر

# PricingSchemaId_RequiredWhenEnter
source: PricingSchemaId is required when PriceType is set to 'Enter
ar: يجب إدخال معرف جدول التسعير عند اختيار نوع التسعير 'عند الدخول

# UserName_Required
source: User name is required
ar: اسم المستخدم مطلوب.

# UserName_Exist
source: User name already exists
ar: اسم المستخدم موجود بالفعل.

# Role_Requred
source: Role is required.
ar: الدور مطلوب

# Email_Required
source: Email is required.
ar: البريد الإلكتروني مطلوب

# Invalid_Email
source: Email is not valid.
ar: البريد الإلكتروني غير صالح

# Email_Exist
source: Email already exists.
ar: البريد الإلكتروني موجود بالفعل.

# Invalid_Password
source: Password must be at least 8 characters long, with at least one uppercase letter, one lowercase letter, and one number.
ar: يجب أن تكون كلمة المرور مكونة من 8 أحرف على الأقل، مع وجود حرف كبير، حرف صغير، ورقم.

# Role_Exist
source: Role does not exist.
ar: الدور غير موجود.

# CardNumber_Require
source: Card number is required for subscriber tickets
ar: رقم الكارت مطلوب لتذاكر المشتركين

# CardNumber_NonRequired
source: Card number must be empty for non-subscriber tickets
ar: يجب ترك رقم الكارت فارغًا للتذاكر غير الخاصة بالمشتركين

# Configuration_NotFound
source: Parking system configuration not found
ar: لم يتم العثور على إعدادات نظام الموقف

# TokenInfo_Missing
source: GateId or UserId not found
ar: لم يتم العثور على رقم البوابة أو رقم المستخدم

# TicketAdd_Unexpected
source: Unexpected error occurred while adding ticket, please try again later
ar: حدث خطأ غير متوقع أثناء إضافة التذكرة، برجاء المحاولة لاحقًا

# Subscriber_Card_InvalidDate
source: Subscriber card is not valid for the current date
ar: بطاقة الاشتراك غير صالحة في التاريخ الحالي

# ConfigurationPricingSchema_Missing
source: Pricing schema is not configured for enter price type
ar: تم ضبط نوع التسعير على (دخول) بدون تحديد مخطط تسعي

# PricingSchema_NotFound
source: Pricing scheme not found
ar: لم يتم العثور على مخطط التسعير المحدد

# QrCode_Require
source: QR code is required
ar: رمز الـ QR مطلوب

# QrInvalid
source: QR code must be a valid Base64 string
ar: رمز الـ QR غير صالح، فشل التحقق من سلامة البيانات

# Ticket_NotFound
source: Ticket not found for the provided QR code
ar: لم يتم العثور على التذكرة المرتبطة بهذا الرمز

# SalaryCalculate_Unexpected
source: Unexpected error occurred while calculating salary, please try again later
ar: حدث خطأ غير متوقع أثناء حساب الرسوم، برجاء المحاولة لاحقًا

source: Subscriber card not found
ar: لم يتم العثور على بطاقة الاشتراك

# Tickets_NoneToCollect
source: No tickets available to collect today for this gate
ar: لا توجد تذاكر متاحة للتحصيل اليوم لهذه البوابة

# TicketsCollectDaily_Unexpected
source: Unexpected error occurred while collecting today's tickets, please try again later
ar: حدث خطأ غير متوقع أثناء تحصيل تذاكر اليوم، برجاء المحاولة لاحقًا

# TicketId_Required
source: Ticket ID is required
ar: رقم التذكرة مطلوب

# Ticket_AlreadyCollected
source: This ticket has already been collected by the cashier
ar: تم تحصيل هذه التذكرة من قبل الكاشير بالفعل

# TicketCollectByCashier_Unexpected
source: Unexpected error occurred while collecting the ticket by cashier, please try again later
ar: حدث خطأ غير متوقع أثناء تحصيل التذكرة من الكاشير، برجاء المحاولة لاحقًا

# AuthLogin_Unexpected
source: Unexpected error occurred during login, please try again later
ar: حدث خطأ غير متوقع أثناء عملية تسجيل الدخول، برجاء المحاولة لاحقًا

# NewPassword_Required
source: Password confirmation does not match the new password
ar: تأكيد كلمة المرور لا يطابق كلمة المرور الجديدة

# ParkingConfigurationUpdate_Unexpected
source: Unexpected error occurred while updating parking system configuration, please try again later
ar: حدث خطأ غير متوقع أثناء تحديث إعدادات نظام الموقف، برجاء المحاولة لاحقًا

# Gate_HasTickets
source: Cannot delete a gate that has tickets
ar: لا يمكن حذف بوابة تحتوي على تذاكر مسجلة

source: Entrance Gate
ar: بوابة دخول

source: Exit Gate
ar: بوابة خروج

# AuthTokenInvalid
source: Token is invalid or missing
ar: التوكن غير صالح أو مفقود

# Auth_InvalidCredentials
source: Invalid username or password
ar: اسم المستخدم أو كلمة المرور غير صحيحة

# AuthTokenUserIdMissing
source: User ID is missing in the token
ar: معرّف المستخدم مفقود في التوكن

# AuthUserNotFound
source: User not found
ar: المستخدم غير موجود

source: Gate not found
ar: لم يتم العثور على البوابة المحددة

# GateRoleMismatch
source: Invalid gate type for your role
ar: نوع البوابة غير مسموح لدورك الحالي

# GateOccupied
source: Gate is occupied by another user
ar: البوابة مشغولة من مستخدم آخر

# GateSelectUnexpected
source: Unexpected error occurred while selecting gate, please try again later
ar: حدث خطأ غير متوقع أثناء اختيار البوابة، برجاء المحاولة لاحقًا
